public class Main {

    /** Многопоточность. Порт. Корабли заходят в порт для разгрузки/загрузки контейнеров.
     * Число конейнеров, находящихся в текущий момент в порту и на корабле,  должно быть неотрицательным
     * и превышающим заданную грузоподъемность судна и вместимость порта. В порту работает несколько причалов.
     * У одного причала может стоять один корабль. Корабль может загружаться у причала или разгружаться.
     */

    public static void main(String[] args) {

        Port port = new Port();   //Запуск порта

    }
}